my_dict = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1,
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2,
    },
    "林俊杰": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3,
    },
    "张学友": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1,
    },
    "刘德华": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2,
    }
}

print(f"员工在升值加薪之前的结果:{my_dict}")

for name in my_dict:
    if my_dict[name]["级别"] == 1:
        ele_dict = my_dict[name]
        ele_dict["级别"] = 2
        ele_dict["工资"] += 1000 
        my_dict[name] = ele_dict

        
print(f"员工在升值加薪之后的结果:{my_dict}")
